In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('Kolkata.csv')

In [3]:
data.head()

,Price,Area,Location,No. of Bedrooms,Resale,MaintenanceStaff,Gymnasium,SwimmingPool,LandscapedGardens,JoggingTrack,...,LiftAvailable,BED,VaastuCompliant,Microwave,GolfCourse,TV,DiningTable,Sofa,Wardrobe,Refrigerator
0,2235000,1016,Barasat,3,0,0,1,1,1,1,...,1,0,0,0,0,0,0,0,0,0
1,3665999,1111,Keshtopur,2,0,1,1,0,1,1,...,0,0,0,0,0,0,0,0,0,0
2,3774000,1020,Rajarhat,2,0,0,1,0,0,0,...,1,0,0,0,0,0,0,0,0,0
3,2524000,935,Narendrapur,2,0,0,1,1,1,1,...,0,0,0,0,0,0,0,0,0,0
4,8300000,1956,New Town,3,1,0,1,1,1,1,...,1,0,1,0,0,0,0,0,0,0

In [4]:
data.shape

(6507, 40)

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6507 entries, 0 to 6506
Data columns (total 40 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Price                6507 non-null   int64
 1   Area                 6507 non-null   int64
 2   Location             6507 non-null   object
 3   No. of Bedrooms      6507 non-null   int64
 4   Resale               6507 non-null   int64
 5   MaintenanceStaff     6507 non-null   int64
 6   Gymnasium            6507 non-null   int64
 7   SwimmingPool         6507 non-null   int64
 8   LandscapedGardens    6507 non-null   int64
 9   JoggingTrack         6507 non-null   int64
 10  RainWaterHarvesting  6507 non-null   int64
 11  IndoorGames          6507 non-null   int64
 12  ShoppingMall         6507 non-null   int64
 13  Intercom             6507 non-null   int64
 14  SportsFacility       6507 non-null   int64
 15  ATM                  6507 non-null   int64
 16  ClubHouse            6507 non-null   int64
 17  School               6507 non-null   int64
 18  24X7Security         6507 non-null   int64
 19  PowerBackup          6507 non-null   int64
 20  CarParking           6507 non-null   int64
 21  StaffQuarter         6507 non-null   int64
 22  Cafeteria            6507 non-null   int64
 23  MultipurposeRoom     6507 non-null   int64
 24  Hospital             6507 non-null   int64
 25  WashingMachine       6507 non-null   int64
 26  Gasconnection        6507 non-null   int64
 27  AC                   6507 non-null   int64
 28  Wifi                 6507 non-null   int64
 29  Children'splayarea   6507 non-null   int64
 30  LiftAvailable        6507 non-null   int64
 31  BED                  6507 non-null   int64
 32  VaastuCompliant      6507 non-null   int64
 33  Microwave            6507 non-null   int64
 34  GolfCourse           6507 non-null   int64
 35  TV                   6507 non-null   int64
 36  DiningTable          6507 non-null   int64
 37  Sofa                 6507 non-null   int64
 38  Wardrobe             6507 non-null   int64
 39  Refrigerator         6507 non-null   int64
dtypes: int64(39), object(1)
memory usage: 2.0+ MB

In [6]:
for column in data.columns:
    print(data[column].value_counts())
    print("*"*20)

4000000    99
4500000    97
5500000    96
3500000    94
6500000    93
           ..
2037000     1
2186000     1
3561999     1
3153000     1
4208000     1
Name: Price, Length: 1660, dtype: int64
********************
800     141
750      98
1100     89
850      85
1200     81
       ...
1612      1
4640      1
3226      1
1329      1
968       1
Name: Area, Length: 1188, dtype: int64
********************
New Town               711
Rajarhat               405
Tangra                 369
Dum Dum                316
Garia                  307
                      ...
New Shakuntala Park      1
Kasba Siemens            1
New Barrackpur           1
Bondal Gate              1
Durganagar               1
Name: Location, Length: 308, dtype: int64
********************
3    3128
2    2622
4     512
1     198
5      38
6       8
9       1
Name: No. of Bedrooms, dtype: int64
********************
0    4478
1    2029
Name: Resale, dtype: int64
********************
9    6432
0      57
1      18
Name: MaintenanceStaff, dtype: int64
********************
9    6432
1      44
0      31
Name: Gymnasium, dtype: int64
********************
9    6432
0      40
1      35
Name: SwimmingPool, dtype: int64
********************
9    6432
0      40
1      35
Name: LandscapedGardens, dtype: int64
********************
9    6432
0      48
1      27
Name: JoggingTrack, dtype: int64
********************
9    6432
0      54
1      21
Name: RainWaterHarvesting, dtype: int64
********************
9    6432
0      45
1      30
Name: IndoorGames, dtype: int64
********************
9    6432
0      69
1       6
Name: ShoppingMall, dtype: int64
********************
9    6432
0      39
1      36
Name: Intercom, dtype: int64
********************
9    6432
0      50
1      25
Name: SportsFacility, dtype: int64
********************
9    6432
0      73
1       2
Name: ATM, dtype: int64
********************
9    6432
0      41
1      34
Name: ClubHouse, dtype: int64
********************
9    6432
0      74
1       1
Name: School, dtype: int64
********************
9    6432
1      47
0      28
Name: 24X7Security, dtype: int64
********************
9    6432
1      53
0      22
Name: PowerBackup, dtype: int64
********************
9    6432
0      41
1      34
Name: CarParking, dtype: int64
********************
9    6432
0      66
1       9
Name: StaffQuarter, dtype: int64
********************
9    6432
0      61
1      14
Name: Cafeteria, dtype: int64
********************
9    6432
0      60
1      15
Name: MultipurposeRoom, dtype: int64
********************
9    6432
0      70
1       5
Name: Hospital, dtype: int64
********************
9    6432
0      69
1       6
Name: WashingMachine, dtype: int64
********************
9    6432
0      72
1       3
Name: Gasconnection, dtype: int64
********************
9    6432
0      70
1       5
Name: AC, dtype: int64
********************
9    6432
0      75
Name: Wifi, dtype: int64
********************
9    6432
1      40
0      35
Name: Children'splayarea, dtype: int64
********************
9    6432
1      57
0      18
Name: LiftAvailable, dtype: int64
********************
9    6432
0      70
1       5
Name: BED, dtype: int64
********************
9    6432
0      55
1      20
Name: VaastuCompliant, dtype: int64
********************
9    6432
0      70
1       5
Name: Microwave, dtype: int64
********************
9    6432
0      72
1       3
Name: GolfCourse, dtype: int64
********************
9    6432
0      72
1       3
Name: TV, dtype: int64
********************
9    6432
0      71
1       4
Name: DiningTable, dtype: int64
********************
9    6432
0      70
1       5
Name: Sofa, dtype: int64
********************
9    6432
0      75
Name: Wardrobe, dtype: int64
********************
9    6432
0      70
1       5
Name: Refrigerator, dtype: int64
********************

In [7]:
data.isna().sum()

Price                  0
Area                   0
Location               0
No. of Bedrooms        0
Resale                 0
MaintenanceStaff       0
Gymnasium              0
SwimmingPool           0
LandscapedGardens      0
JoggingTrack           0
RainWaterHarvesting    0
IndoorGames            0
ShoppingMall           0
Intercom               0
SportsFacility         0
ATM                    0
ClubHouse              0
School                 0
24X7Security           0
PowerBackup            0
CarParking             0
StaffQuarter           0
Cafeteria              0
MultipurposeRoom       0
Hospital               0
WashingMachine         0
Gasconnection          0
AC                     0
Wifi                   0
Children'splayarea     0
LiftAvailable          0
BED                    0
VaastuCompliant        0
Microwave              0
GolfCourse             0
TV                     0
DiningTable            0
Sofa                   0
Wardrobe               0
Refrigerator           0
dtype: int64

In [8]:
data = data.drop(columns = ['Refrigerator', 'Wardrobe', 'Sofa', 'DiningTable', 'TV', 'GolfCourse', ])

In [9]:
data.describe()

               bath         price
count  13247.000000  13320.000000
mean       2.692610    112.565627
std        1.341458    148.971674
min        1.000000      8.000000
25%        2.000000     50.000000
50%        2.000000     72.000000
75%        3.000000    120.000000
max       40.000000   3600.000000

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13319 non-null  object
 1   size        13304 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13247 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [11]:
data['location'].value_counts()

Whitefield                        540
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: location, Length: 1305, dtype: int64

In [12]:
data['location'] = data['location'].fillna('Sarjapur Road')

In [13]:
data['size'].value_counts()

2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: size, dtype: int64

In [14]:
data['size'] = data['size'].fillna('2 BHK')

In [15]:
data['bath'] = data['bath'].fillna(data['bath'].median())

In [16]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13320 non-null  object
 1   size        13320 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13320 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [17]:
data['bhk'] = data['size'].str.split().str.get(0).astype(int)

In [18]:
data[data.bhk > 20]

                       location        size total_sqft  bath  price  bhk
1718  2Electronic City Phase II      27 BHK       8000  27.0  230.0   27
4684                Munnekollal  43 Bedroom       2400  40.0  660.0   43

In [19]:
data['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [20]:
def covertRange(x):
    
    temp = x.split('-')
    if len(temp)  == 2:
        return (float(temp[0]) + float(temp[1])) / 2
    
    try:
        return float(x)
    except:
        return None

In [21]:
data['total_sqft'] = data['total_sqft'].apply(covertRange)

In [22]:
data.head()

                   location       size  total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00    4
2               Uttarahalli      3 BHK      1440.0   2.0   62.00    3
3        Lingadheeranahalli      3 BHK      1521.0   3.0   95.00    3
4                  Kothanur      2 BHK      1200.0   2.0   51.00    2

In [23]:
data['price_per_sqft'] = data['price'] * 100000 / data['total_sqft']

In [24]:
data['price_per_sqft']

0         3699.810606
1         4615.384615
2         4305.555556
3         6245.890861
4         4250.000000
             ...
13315     6689.834926
13316    11111.111111
13317     5258.545136
13318    10407.336319
13319     3090.909091
Name: price_per_sqft, Length: 13320, dtype: float64

In [25]:
data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13274.000000  13320.000000  13320.000000  13320.000000    1.327400e+04
mean    1559.626694      2.688814    112.565627      2.802778    7.907501e+03
std     1238.405258      1.338754    148.971674      1.294496    1.064296e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.266865e+03
50%     1276.000000      2.000000     72.000000      3.000000    5.434306e+03
75%     1680.000000      3.000000    120.000000      3.000000    7.311746e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [26]:
data['location'].value_counts()

Whitefield                        540
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Uvce Layout                         1
Abshot Layout                       1
Name: location, Length: 1306, dtype: int64

In [27]:
data['location'] = data['location'].apply(lambda x: x.strip())
location_count = data['location'].value_counts()

In [28]:
location_count

Whitefield                            541
Sarjapur  Road                        399
Electronic City                       304
Kanakpura Road                        273
Thanisandra                           237
                                     ...
1Channasandra                           1
Hosahalli                               1
Vijayabank bank layout                  1
near Ramanashree California resort      1
Abshot Layout                           1
Name: location, Length: 1295, dtype: int64

In [29]:
location_count_less_10 = location_count[location_count <= 10]
location_count_less_10

BTM 1st Stage                         10
Nagadevanahalli                       10
Basapura                              10
Sector 1 HSR Layout                   10
Dairy Circle                          10
                                      ..
1Channasandra                          1
Hosahalli                              1
Vijayabank bank layout                 1
near Ramanashree California resort     1
Abshot Layout                          1
Name: location, Length: 1054, dtype: int64

In [30]:
data['location'] = data['location'].apply(lambda x: 'other' if x in location_count_less_10 else x)

In [31]:
data['location'].value_counts()

other                 2886
Whitefield             541
Sarjapur  Road         399
Electronic City        304
Kanakpura Road         273
                      ...
Nehru Nagar             11
Banjara Layout          11
LB Shastri Nagar        11
Pattandur Agrahara      11
Narayanapura            11
Name: location, Length: 242, dtype: int64

In [32]:
data.shape

(13320, 7)

In [33]:
data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13274.000000  13320.000000  13320.000000  13320.000000    1.327400e+04
mean    1559.626694      2.688814    112.565627      2.802778    7.907501e+03
std     1238.405258      1.338754    148.971674      1.294496    1.064296e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.266865e+03
50%     1276.000000      2.000000     72.000000      3.000000    5.434306e+03
75%     1680.000000      3.000000    120.000000      3.000000    7.311746e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [34]:
(data['total_sqft']/data['bhk']).describe()

count    13274.000000
mean       575.074878
std        388.205175
min          0.250000
25%        473.333333
50%        552.500000
75%        625.000000
max      26136.000000
dtype: float64

In [35]:
data.shape

(13320, 7)